#ifndef DRAGON_H
#define DRAGON_H
#include<QString>

//Этот класс хранит в себе только строку с драконом, в память о прошлом обучении, больше он ни для чего не нужен.
//Я буду создавать обьект с драконом в главном файле и выводить его перед пользователем

class Dragon
{
public:
    Dragon();

    QString Yasher = QString(
        "                                (====-_  _-====__\n"
        "                   _--^^^#####//      \\#####^^^--_\n"
        "              _-^##########// (    ) \\##########^-_\n"
        "           -############//  |\\^^/|  \\############-\n"
        "         _/############//   (@::@)   \\############\\_\n"
        "          /#############((     \\\\//     ))#############\\\n"
        "      -###############\\\\    (oo)    //###############-\n"
        "     ################\\\\  / VV \\  //#################-\n"
        "-###################\\\\/      \\\\//###################-\n"
        " _#/|##########/\\######(   /\\   )######/\\##########|\\#_\n"
        "                  |/ |#\\/\\#/\\/  #/##\\  |  |  /##/#/  /#/#/#| |\n"
        "                        |/  V  V     V  #| |  | |/#/  V   '  V  V  |  '\n"
        "                                            / | |  | | \\   '      '  '   '\n"
        "                                           (  | |  | |  )\n"
        "                                            \\ | |  | | /\n"
        "                                   (vvv(VVV)(VVV)vvv)\n"
        );

    QString Hello="Приветствую вас пользователь!";
    QString Hello1="Чат создан Даниилом Куликовым.";


};
#endif // DRAGON_H
